### Cleaning DF1 (information about client)

In [229]:
#Importing library and  df_final_ demo csv file
import pandas as pd

df1 = pd.read_csv('https://raw.githubusercontent.com/houleye45/vanguard_ab_test_week5_project/main/data/raw/df_final_demo.txt')
df1.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [230]:
#Checking shape
df1.shape

(70609, 9)

In [231]:
#Renaming the columns 
df1.rename(columns= {'clnt_tenure_yr': 'tenure_year', 'clnt_tenure_mnth': 'tenure_month', 'clnt_age': 'age',
                     'gendr': 'gender', 'num_accts': 'number_of_accounts', 'bal': 'balance'}, inplace=True)

In [232]:
df1.head()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

#### Cleaning gender column

In [233]:
#Checking gender values and replace null values and X as U 
df1['gender'].unique
df1['gender'] = df1['gender'].replace('X', 'U')
df1['gender'] = df1['gender'].fillna('U')

In [234]:
#Replacing U values as F or M 

total_U = df1['gender'].value_counts()['U']
half_U = total_U // 2

indices_U = df1[df1['gender'] == 'U'].index

df1.loc[indices_U[:half_U], 'gender'] = 'M'
df1.loc[indices_U[half_U:], 'gender'] = 'F'

In [235]:
df1['gender'].value_counts()

gender
M    35793
F    34816
Name: count, dtype: int64

### Cleaning DF2 (Variation)

In [236]:
df2 = pd.read_csv('https://raw.githubusercontent.com/houleye45/vanguard_ab_test_week5_project/main/data/raw/df_final_experiment_clients.txt')
df2.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [237]:
df2.dtypes

client_id     int64
Variation    object
dtype: object

In [238]:
df2.shape

(70609, 2)

In [239]:
df2.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [240]:
df2['Variation'] = df2['Variation'].fillna('no participation')
df2.isnull().sum()

client_id    0
Variation    0
dtype: int64

In [241]:
df2 = df2.dropna(axis=0)
df2.shape

(70609, 2)

### Cleaning DF3 (online activity)

In [242]:
df3 = pd.read_csv('https://raw.githubusercontent.com/houleye45/vanguard_ab_test_week5_project/main/data/raw/df_final_web_data_pt_1.txt')
df3.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [243]:
df3.shape

(343141, 5)

In [244]:
df3.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [245]:
df3.duplicated().sum()

2095

In [246]:
df3 = df3.drop_duplicates()
df3.shape

(341046, 5)

In [247]:
df3.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [248]:
df3['date_time'] = pd.to_datetime(df3['date_time'])
df3.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

### Cleaning DF4 (online activity)

In [249]:
df4 = pd.read_csv('https://raw.githubusercontent.com/houleye45/vanguard_ab_test_week5_project/main/data/raw/df_final_web_data_pt_2.txt')
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [250]:
df4.shape

(412264, 5)

In [251]:
df4.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [252]:
df4.duplicated().sum()

8669

In [253]:
df4 = df4.drop_duplicates()

In [254]:
df4.shape

(403595, 5)

In [255]:
df4.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [256]:
df4['date_time'] = pd.to_datetime(df4['date_time'])

In [257]:
df4.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

In [258]:
df4.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

### Concatening csv files about online activity

In [259]:
df5 = pd.concat([df3, df4], axis=0)

In [260]:
df5.shape

(744641, 5)

In [261]:
df5['client_id'].nunique()

120157

In [262]:
df5.isna().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [263]:
#Converting date time column

df5['date_time'] = pd.to_datetime(df3['date_time'])
df5.dtypes

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
dtype: object

####  Keeping only last start attempt

In [264]:
df5 = df5.sort_values(by=['client_id', 'date_time'])

# Identify the last "start" step for each client_id
last_start_df = df5[df5['process_step'] == 'start'].groupby('client_id')['date_time'].max().reset_index()

# Merge the last start and last confirm times with the original DataFrame
df5 = pd.merge(df5, last_start_df, on='client_id', how='left', suffixes=('', '_last_start'))

# Correct the filtering condition using parentheses for both conditions
client_last_start = df5[(df5['date_time'] >= df5['date_time_last_start'])]

# Drop the helper columns
client_last_start = client_last_start.drop(columns=['date_time_last_start'])
client_last_start

,client_id,visitor_id,visit_id,process_step,date_time
0,169,201385055_71273495308,749567106_99161211863_557568,start,2017-04-12 20:19:36
1,169,201385055_71273495308,749567106_99161211863_557568,step_1,2017-04-12 20:19:45
2,169,201385055_71273495308,749567106_99161211863_557568,step_2,2017-04-12 20:20:31
3,169,201385055_71273495308,749567106_99161211863_557568,step_3,2017-04-12 20:22:05
4,169,201385055_71273495308,749567106_99161211863_557568,confirm,2017-04-12 20:23:09
...,...,...,...,...,...
744636,9999875,738878760_1556639849,931268933_219402947_599432,start,2017-04-05 09:40:00
744637,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-04-05 09:40:06
744638,9999875,738878760_1556639849,931268933_219402947_599432,step_1,2017-04-05 09:40:10
744639,9999875,738878760_1556639849,931268933_219402947_599432,step_2,2017-04-05 09:40:28
744640,9999875,738878760_1556639849,931268933_219402947_599432,step_3,2017-04-05 09:42:18

### Final dataset

In [265]:
df_client_info = pd.read_csv('https://raw.githubusercontent.com/houleye45/vanguard_ab_test_week5_project/main/data/clean/df_client_info.csv')
df_client_info.head()

,Unnamed: 0,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth,Variation
0,0,836976,6.0,73.0,60.5,M,2.0,45105.30,6.0,9.0,Test
1,1,2304905,7.0,94.0,58.0,M,2.0,110860.30,6.0,9.0,Control
2,2,1439522,5.0,64.0,32.0,M,2.0,52467.79,6.0,9.0,Test
3,3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control

In [266]:
df_client_info = df_client_info.drop(columns=['Unnamed: 0'], errors='ignore')
df_client_info.head()

,client_id,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,M,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,M,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,M,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control

In [267]:
df_total_info = pd.merge(client_last_start, df_client_info, on='client_id', how='inner')
df_total_info.head()

,client_id,visitor_id,visit_id,process_step,date_time,tenure_year,tenure_month,age,gender,number_of_accounts,balance,calls_6_mnth,logons_6_mnth,Variation
0,169,201385055_71273495308,749567106_99161211863_557568,start,2017-04-12 20:19:36,21.0,262.0,47.5,M,2.0,501570.72,4.0,4.0,no participation
1,169,201385055_71273495308,749567106_99161211863_557568,step_1,2017-04-12 20:19:45,21.0,262.0,47.5,M,2.0,501570.72,4.0,4.0,no participation
2,169,201385055_71273495308,749567106_99161211863_557568,step_2,2017-04-12 20:20:31,21.0,262.0,47.5,M,2.0,501570.72,4.0,4.0,no participation
3,169,201385055_71273495308,749567106_99161211863_557568,step_3,2017-04-12 20:22:05,21.0,262.0,47.5,M,2.0,501570.72,4.0,4.0,no participation
4,169,201385055_71273495308,749567106_99161211863_557568,confirm,2017-04-12 20:23:09,21.0,262.0,47.5,M,2.0,501570.72,4.0,4.0,no participation

#### Splitting ouf final dataset between test, control, no participation

In [268]:
df_test_info = df_total_info[df_total_info['Variation'] == 'Test']
df_control_info = df_total_info[df_total_info['Variation'] == 'Control']
df_no_participation_info = df_total_info[df_total_info['Variation'] == 'no participation']

In [269]:
print(df_test_info['client_id'].nunique())
print(df_control_info['client_id'].nunique())
print(df_no_participation_info['client_id'].nunique())

26660
23373
17518

### Exporting CSV files

In [270]:
#digital_footprints.to_csv('../../data/clean/digital_footprints_final.csv', index=False)
#df_client_info.to_csv('../../data/clean/df_client_info.csv', index=False) 
#client_last_start.to_csv('../../data/clean/client_last_start.csv', index=False)
#df_total_info.to_csv('../../data/clean/df_total_info.csv', index=False)
#df_test_info.to_csv('../../data/clean/df_test_info.csv', index=False)
#df_control_info.to_csv('../../data/clean/df_control_info.csv', index=False)
#df_no_participation_info.to_csv('../../data/clean/df_no_participation_info.csv', index=False)